fruit_list = ["ぶどう", "バナナ", "メロン", "いちご"]
print(f'[task 1] fruit_list:{fruit_list}')

# 課題1-1　配列から"バナナ"だけを取り出そう

# 課題1-2　最後の1つ"いちご"だけを取り出そう

# 課題1-3　最初の2つ("ぶどう"、"バナナ")を配列のまま取り出そう

# 課題1-4　後ろの2つ("メロン"、"いちご")を配列のまま取り出そう

# 課題1-5　間の2つ("バナナ", "メロン")を配列のまま取り出そう


# 辞書型からデータを取り出そう
fruit_dic = {"ぶどう":"紫色", "バナナ":"黄色", "メロン":"緑色", "いちご":"赤色"}
print(f'[task 1] fruit_dic:{fruit_dic}')

# 課題1-6　辞書からバナナの色を取り出そう


# 辞書・配列の混合
fruit_mixed_dic = {"ぶどう":["紫色",100], "バナナ":["黄色",200], "メロン":["緑色",300], "いちご":["赤色",500]}
print(f'[task 1] fruit_mixed_dic:{fruit_mixed_dic}')

# 課題1-7　メロンの値段を取り出そう

